package ui

const WelcomeMessage = `Привет, меня зовут Ингли, я твой помощник в изучении английских слов! 👾

Я работаю по интервальным повторениям — просто и эффективно. Подписывайся на словари, учи слова, а я как твой бортовой компьютер буду вычислять усвоение материала: сложные слова буду показывать чаще, и про лёгкие тоже не забудем 😉
` + HelpMessage

const HelpMessage = `
Нажимай на кнопки внизу экрана, либо пиши следующие команды в чат:

- /start - еще раз посмотреть приветственное сообщение 🙂
- /help - посмотреть список команд 📖
- /dict - список опубликованных словарей, на которые можно подписаться 📚
- /sub <название словаря> - подписаться на словарь. После этого сможешь взяться за изучение слов оттуда 🔎
- /unsub <название словаря> - словарь мне не понравился, забери его назад 🤓 (весь прогресс по словам из него будет стёрт!)
- /mydict - список словарей, на которые ты подписан. Из них можно учить слова 📚
- /learn <название словаря> - приступить к изучению. Я буду показывать тебе новые слова, их перевод и как они произносятся. Старайся запомнить! 🧠
- /review <название словаря> - покажу уже знакомые слова. Оцени, как хорошо их помнишь, и я буду подбрасывать их снова: чем хуже помнишь — тем чаще они будут выпадать 🎲
`

const RemoveMessage = `Ты удален, все данные тоже`

const InternalErrorMessage = `Бип-буп, я сломался 😵‍💫`
