package ui

// Onboarding
const WelcomeMsg = `Привет, меня зовут Ингли, я твой помощник в изучении английских слов! 👾

Я работаю по интервальным повторениям — просто и эффективно. Подписывайся на словари, учи слова, а я как твой бортовой компьютер буду вычислять усвоение материала: сложные слова буду показывать чаще, и про лёгкие тоже не забудем 😉
` + HelpMsg

const HelpMsg = `
Нажимай на кнопки внизу экрана, либо пиши следующие команды в чат:

- /start - еще раз посмотреть приветственное сообщение 🙂
- /help - посмотреть список команд 📖
- /dict - список опубликованных словарей, на которые можно подписаться 📚
- /mydict - список словарей, на которые ты подписан. Из них можно учить слова 📚
- /learn <номер словаря> - приступить к изучению: я буду показывать тебе новые слова и их перевод. Старайся запомнить!  🧠
- /review <номер словаря> - приступить к повторению: оценивай, насколько хорошо помнишь слова, и я буду подбрасывать их снова (чем хуже помнишь — тем чаще будут выпадать) 🎲
`

const RemoveMsg = `Все данные удалены 🫥`

// Catalog
const (
	PublicDictionariesEmptyMsg  = `Пока нет опубликованных словарей 💤`
	UserDictionariesEmptyMsg    = `Ты пока не подписан ни на один словарь 💤`
	PublicDictionariesHeaderMsg = `Доступные словари:`
	UserDictionariesHeaderMsg   = `Твои словари:`
)

// Subscription
const (
	DictionarySubscribedMsg           = `Подписка оформлена ✅`
	DictionaryAlreadySubscribedMsg    = `Ты уже подписан на этот словарь 👌`
	DictionaryUnsubscribeConfirmMsg   = `❕Весь прогресс по словам будет стёрт. Ты уверен, что хочешь отписаться?`
	DictionaryUnsubscribedMsg         = `Подписка отменена ✅`
	DictionaryUnsubscribeCanceledMsg  = `Ты по-прежнему подписан на этот словарь 👌`
	DictionarySubscriptionNotFoundMsg = `Ты не подписан на этот словарь`
	DictionaryNotFoundMsg             = `Словарь не найден 🧐`
)

// Learning
const (
	LearnUsageMsg                   = `Использование: /learn <номер словаря из списка>`
	LearnInvalidDictionaryNumberMsg = `Не нашел словарь с таким номером. Посмотри /mydict и попробуй снова`
	LearnNotSubscribedMsg           = `Сначала подпишись на словарь, потом приступай к изучению`
	LearnNotStartedMsg              = `Сначала открой обучение через /learn <номер словаря> или кнопку «Учить» у себя в словарях`

	LearnCompletedMsg = `
Поздравляю, ты прошел словарь! 🎉🥳🎉
А ты уверен, что помнишь все слова из него?
`
)

// Review
const (
	LearnReviewWIPMsg = `WIP`
)

// Other messages
const (
	InternalErrorMsg = `Бип-буп, я сломался 😵‍💫`
	ToMainMenuMsg    = "⏮️ Возврат в меню"
)
